content/index.org
#+title: Page fault making machine

* What is this?

This is a work-in-progress blog where I intend to upload stuff I do not know
where to communicate otherwise. Most (all?) of this stuff will be programming and/or
math related.

* Who am I?

I am a programmer (mostly C++) and I like math.

* Blog Index

This should be populated some day...

[[./empathising-with-c++20-coroutines/main.org][Empathising with C++20 coroutines]]
