index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Page fault making machine</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Page fault making machine</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org38a190c">What is this?</a></li>
<li><a href="#orgf49b2f3">Who am I?</a></li>
<li><a href="#org9f5b414">Blog Index</a></li>
</ul>
</div>
</div>

<div id="outline-container-org38a190c" class="outline-2">
<h2 id="org38a190c">What is this?</h2>
<div class="outline-text-2" id="text-org38a190c">
<p>
This is a work-in-progress blog where I intend to upload stuff I do not know
where to communicate otherwise. Most (all?) of this stuff will be programming and/or
math related.
</p>
</div>
</div>

<div id="outline-container-orgf49b2f3" class="outline-2">
<h2 id="orgf49b2f3">Who am I?</h2>
<div class="outline-text-2" id="text-orgf49b2f3">
<p>
I am a programmer (mostly C++) and I like math.
</p>
</div>
</div>

<div id="outline-container-org9f5b414" class="outline-2">
<h2 id="org9f5b414">Blog Index</h2>
<div class="outline-text-2" id="text-org9f5b414">
<p>
This should be populated some day&#x2026;
</p>

<p>
<a href="./empathising-with-c++20-coroutines/main.html">Empathising with C++20 coroutines</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
